def line():
    print("#","-"*40)
#-----------------------------------------------------------
line()

score = [88, 90, 91, 96, 98]
for s in score:
    print("점수는", s)

#-----------------------------------------------------------
line()

no = 1
for s in score:
    print(str(no) + "번째 학생의 점수는", s)
    no += 1

#-----------------------------------------------------------
line()

score = [90, 80, 76, 85, 69]
for no in range(len(score)):
    print(str(no+1) + "번째 학생의 점수는", score[no])

#-----------------------------------------------------
line()

for no, s in enumerate(score, 1):
    print(str(no) + "번째 학생의 성적:", s)

#-----------------------------------------------------
line()

yoil = ["월", "화", "수", "목", "금", "토", "일"] 
food = ["갈비탕", "순대국", "칼국수", "삼겹살", "목살"]
menu = zip(yoil, food)
for y, f in menu:
    print("%s요일 메뉴 : %s" % (y,f))

dict(zip(yoil, food))

